IDENTIFICATION DIVISION.
PROGRAM-ID. DIVISION-REPRESENTATION.
AUTHOR. RUPA KUMARI.
INSTALLATION. MF.
DATE-WRITTEN. 18 AUG 2022.
DATE-COMPILED. 18 AUG 2022.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER.
OBJECT-COMPUTER.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-VAR				 PIC X(50).


PROCEDURE DIVISION.
MAIN-PARA.
	DISPLAY 'ROW 1-6 COMES UNDER IDENTIFICATION DIVISION'.
	DISPLAY 'ROW 7-12 COMES UNDER ENVIRONMENT DIVISION'.
	DISPLAY 'ROW 13-15 COMES UNDER DATA DIVISION'.
	DISPLAY 'ROW AFTER 16 WILL COMES UNDER PROCEDURE DIVISION'.
STOP RUN.
