IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
*>simple hello world program
PROCEDURE DIVISION.
       DISPLAY 'Hello world!'.
       
       PERFORM SHOWIT 5 TIMES.
       STOP RUN.





SHOWIT.
       DISPLAY 'Maybe'.
